app/controllers/photos_controller.rb

  def create
    @photo = current_user.photos.build photo_params
    @photo.place = @place
    @photo.save
---
INSERT INTO "photos" ("user_id", "place_id", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["place_id", 1], ["image_file_name", "bLKBPsb_-_Imgur.jpg"], ["image_content_type", "image/jpeg"], ["image_file_size", 3382799], ["image_updated_at", "2018-12-03 01:30:10.037046"]]

  def set_place
    @place = Place.find params[:place_id]
---
SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]