app/controllers/places_controller.rb

INSERT INTO "places" ("name", "street", "number", "district", "zip_code", "city", "state", "complement", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @place = Place.new place_params
    @place.save

SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def edit
    @place = Place.find params[:id]

SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "places" SET "kind" = ?, "updated_at" = ? WHERE "places"."id" = ?  [["kind", "Ponto Turístico"], ["updated_at", "2018-11-26 19:44:06.057625"], ["id", 3]]
---
  def update
    @place = Place.find params[:id]
    @place.update kind_place_params

SELECT "places".* FROM "places" WHERE "places"."id" = ?  [["id", 3]]
---
  def show
    @place = Place.find params[:id]