app/controllers/reviews_controller.rb

  def create
    @review = current_user.reviews.build review_params
    @review.place = @place
    @review.save
---
INSERT INTO "reviews" ("user_id", "place_id", "comment", "score", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["place_id", 1], ["comment", "Um lugar bem legal ein"], ["score", 8], ["created_at", "2018-11-26 19:30:11.775882"], ["updated_at", "2018-11-26 19:30:11.775882"]]

  def destroy
    @review = Review.find params[:id]
    place = @review.place
    @review.destroy
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 4]]

  def set_place
    @place = Place.find params[:place_id]
---
SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]