app/views/places/index.html.slim

      = f.label 'Tipo'
      = f.select :kind_eq, Place.kinds, include_blank: true
---
SELECT "places".* FROM "places"