app/views/places/show.html.slim


- @place.reviews.each do |r|
  .card
    .card-body
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."place_id" = ?  [["place_id", 3]]


- @place.photos.each do |p|
  .card
    .card-body
---
SELECT "photos".* FROM "photos" WHERE "photos"."place_id" = ?  [["place_id", 3]]